<?php
$base = array(
  array(
    "domain" => (""),
    "city_1" => ("Москва"),
    "city_2" => ("Москве"),
    "city_3" => ("Москвы"),
    "address" => ("Угрешская ул., 2, Москва, Россия, 115088"),
    "important" => (true),
    "coordinates" => [55.711356, 37.683545]
  ),
  array(
    "domain" => ("spb"),
    "city_1" => ("Санкт-Петербург"),
    "city_2" => ("Санкт-Петербурге"),
    "city_3" => ("Санкт-Петербурга"),
    "address" => ("Кронверкская ул., 5 Санкт-Петербург Россия 197101"),
    "important" => (true),
    "coordinates" => [59.958169, 30.313164]
  ),

  array( //sar
    "domain" => ("saratov"),
    "city_1" => ("Саратов"),
    "city_2" => ("Саратове"),
    "city_3" => ("Саратова"),
    "address" => ("Саратовская обл., г. Саратов, ул. Огородная дом 77"),
    "important" => (false),
    "coordinates" => [51.512912, 45.955151]
  ),
  //saratov
  array(
    "domain" => ("smolensk"),
    "city_1" => ("Смоленск"),
    "city_2" => ("Смоленске"),
    "city_3" => ("Смоленска"),
    "address" => ("Смоленская обл., г. Смоленск, ул. Николаева дом 25"),
    "important" => (false),
    "coordinates" => [54.772271, 32.035082]
  ),

  array(
    "domain" => ("orel"),
    "city_1" => ("Орел"),
    "city_2" => ("Орле"),
    "city_3" => ("Орла"),
    "address" => ("Орловская обл., г. Орел, ул. Серпуховская дом 111"),
    "important" => (false),
    "coordinates" => [52.976314, 36.130600]
  ),

  array(
    "domain" => ("orenburg"),
    "city_1" => ("Оренбург"),
    "city_2" => ("Оренбурге"),
    "city_3" => ("Оренбурга"),
    "address" => ("Оренбургская обл., г. Оренбург, ул. Розы Люксембург дом 180"),
    "important" => (false),
    "coordinates" => [51.801171, 55.057133]
  ),

  array(
    "domain" => ("ekaterinburg"),
    "city_1" => ("Екатеринбург"),
    "city_2" => ("Екатеринбурге"),
    "city_3" => ("Екатеринбурга"),
    "address" => ("Свердловская обл., г. Екатеринбург, ул. Мира дом 19"),
    "important" => (false),
    "coordinates" => [56.844028, 60.654068]
  ),

  array(
    "domain" => ("krasnodar"),
    "city_1" => ("Краснодар"),
    "city_2" => ("Краснодаре"),
    "city_3" => ("Краснодара"),
    "address" => ("Краснодарский край, г. Краснодар, ул. Садовая дом 67"),
    "important" => (false),
    "coordinates" => [45.034439, 38.992695]
  ),

  array(
    "domain" => ("kazan"),
    "city_1" => ("Казань"),
    "city_2" => ("Казани"),
    "city_3" => ("Казани"),
    "address" => ("Татарстан респ., г. Казань, ул. Юбилейная дом 1 /43"),
    "important" => (false),
    "coordinates" => [55.825826, 49.029509]
  ),

  array(
    "domain" => ("lipetsk"),
    "city_1" => ("Липецк"),
    "city_2" => ("Липецке"),
    "city_3" => ("Липецка"),
    "address" => ("Липецкая обл., г. Липецк, ул. Горького дом 12"),
    "important" => (false),
    "coordinates" => [52.603685, 39.585000]
  ),
  array(
    "domain" => ("rostov"),
    "city_1" => ("Ростов"),
    "city_2" => ("Ростове"),
    "city_3" => ("Ростова"),
    "address" => ("Ростовская Область г. Ростов-На-Дону Буденновский проспект д.50/78"),
    "important" => (false),
    "coordinates" => [47.224624, 39.706488]
  ),

  array(
    "domain" => ("ryazan"),
    "city_1" => ("Рязань"),
    "city_2" => ("Рязани"),
    "city_3" => ("Рязани"),
    "address" => ("Рязанская обл., г. Рязань, ул. Дзержинского дом 60 к.2"),
    "important" => (false),
    "coordinates" => [54.620355, 39.723529]
  ),

  array(
    "domain" => ("ufa"),
    "city_1" => ("Уфа"),
    "city_2" => ("Уфе"),
    "city_3" => ("Уфы"),
    "address" => ("Башкортостан респ., г. Уфа, ул. Матросова дом 1"),
    "important" => (false),
    "coordinates" => [54.717043, 55.946923]
  ),

  array(
    "domain" => ("ulanude"),
    "city_1" => ("Улан-Удэ"),
    "city_2" => ("Улан-Удэ"),
    "city_3" => ("Улан-Удэ"),
    "address" => ("Бурятия респ., г. Улан-Удэ, Энергетик п., дом 44 А"),
    "important" => (false),
    "coordinates" => [51.834464, 107.584574]
  ),

  array(
    "domain" => ("derbent"),
    "city_1" => ("Дербент"),
    "city_2" => ("Дербенте"),
    "city_3" => ("Дербента"),
    "address" => ("Дагестан респ., г. Дербент, ул. Вокзальная дом 1"),
    "important" => (false),
    "coordinates" => [42.056270, 48.306608]
  ),

  array(
    "domain" => ("ivanovo"),
    "city_1" => ("Иваново"),
    "city_2" => ("Иваново"),
    "city_3" => ("Иванова"),
    "address" => ("Ивановская обл., г. Иваново, ул. Громобоя дом 16 /50"),
    "important" => (false),
    "coordinates" => [57.010387, 40.975071]
  ),

  array(
    "domain" => ("izhevsk"),
    "city_1" => ("Ижевск"),
    "city_2" => ("Ижевске"),
    "city_3" => ("Ижевска"),
    "address" => ("Удмуртская респ., г. Ижевск, ул. Вадима Сивкова дом 105"),
    "important" => (false),
    "coordinates" => [56.835505, 53.208131]
  ),


  array(
    "domain" => ("vladivostok"),
    "city_1" => ("Владивосток"),
    "city_2" => ("Владивостоке"),
    "city_3" => ("Владивостока"),
    "address" => ("Приморский край, г. Владивосток, ул. Героев Тихоокеанцев общ. 22  690017 "),
    "important" => (false),
    "coordinates" => [43.088594, 131.922280]
  ),

  array(
    "domain" => ("vladikavkaz"),
    "city_1" => ("Владикавказ"),
    "city_2" => ("Владикавказе"),
    "city_3" => ("Владикавказа"),
    "address" => ("Северная Осетия - Алания респ., г. Владикавказ, ул. Герасимова дом 21                                            362002"),
    "important" => (false),
    "coordinates" => [43.043523, 44.670991]
  ),

  array(
    "domain" => ("volgograd"),
    "city_1" => ("Волгоград"),
    "city_2" => ("Волгограде"),
    "city_3" => ("Волгограда"),
    "address" => ("Волгоградская обл., г. Волгоград, пр. Металлургов дом 14                          400007"),
    "important" => (false),
    "coordinates" => [48.768612, 44.553761]
  ),

  array(
    "domain" => ("habarovsk"),
    "city_1" => ("Хабаровск"),
    "city_2" => ("Хабаровске"),
    "city_3" => ("Хабаровска"),
    "address" => ("Хабаровский край, г. Хабаровск, ул. Краснореченская дом 73"),
    "important" => (false),
    "coordinates" => [48.399705, 135.100366]
  ),

  array(
    "domain" => ("samara"),
    "city_1" => ("Самара"),
    "city_2" => ("Самаре"),
    "city_3" => ("Самары"),
    "address" => ("Самарская обл., г. Самара, пер. Молодежный дом 22"),
    "important" => (false),
    "coordinates" => [53.113168, 50.076918]
  ),

  array(
    "domain" => ("blagoveschensk"),
    "city_1" => ("Благовещенск"),
    "city_2" => ("Благовещенске"),
    "city_3" => ("Благовещенска"),
    "address" => ("Амурская обл., г. Благовещенск, ул. Лазо дом 60"),
    "important" => (false),
    "coordinates" => [50.259409, 127.565531]
  ),

  array(
    "domain" => ("sahalinsk"),
    "city_1" => ("Южно-Сахалинск"),
    "city_2" => ("Южно-Сахалинске"),
    "city_3" => ("Южно-Сахалинска"),
    "address" => ("Сахалинская обл., г. Южно-Сахалинск, ул. Украинская дом 105А"),
    "important" => (false),
    "coordinates" => [46.981605, 142.718143]
  ),

  array(
    "domain" => ("petropavlovsk"),
    "city_1" => ("Петропавловск-Камчатский"),
    "city_2" => ("Петропавловске-Камчатском"),
    "city_3" => ("Петропавловска-Камчатского"),
    "address" => ("Камчатский край, г. Петропавловск-Камчатский, ул. Комсомольская дом 14                                                              683030"),
    "important" => (false),
    "coordinates" => [52.971553, 158.685994]
  ),

  array(
    "domain" => ("penza"),
    "city_1" => ("Пенза"),
    "city_2" => ("Пензе"),
    "city_3" => ("Пензы"),
    "address" => ("Пензенская обл., г. Пенза, ул. Индустриальная дом 38"),
    "important" => (false),
    "coordinates" => [53.166354, 45.026958]
  ),

  array(
    "domain" => ("pyatigorsk"),
    "city_1" => ("Пятигорск"),
    "city_2" => ("Пятигорске"),
    "city_3" => ("Пятигорска"),
    "address" => ("Ставропольский край, г. Пятигорск, Горячеводский пгт, ул. Ленина дом 24"),
    "important" => (false),
    "coordinates" => [44.029912, 43.099703]
  ),


  array(
    "domain" => ("yakutsk"),
    "city_1" => ("Якутск"),
    "city_2" => ("Якутске"),
    "city_3" => ("Якутска"),
    "address" => ("Ярославская обл., г. Ярославль, ул. Стачек дом 55"),
    "important" => (false),
    "coordinates" => [57.609375, 39.833132]
  ),

  array(
    "domain" => ("irkutsk"),
    "city_1" => ("Иркутск"),
    "city_2" => ("Иркутске"),
    "city_3" => ("Иркутска"),
    "address" => ("Иркутская обл., г. Иркутск, ул. Карла Маркса дом 28"),
    "important" => (false),
    "coordinates" => [52.283032, 104.286679]
  ),

  array(
    "domain" => ("yaroslavl"),
    "city_1" => ("Ярославль"),
    "city_2" => ("Ярославле"),
    "city_3" => ("Ярославля"),
    "address" => ("Ярославская обл., г. Ярославль, ул. Стачек дом 55"),
    "important" => (false),
    "coordinates" => [57.609375, 39.833132]
  ),

  array(
    "domain" => ("krasnoyarsk"),
    "city_1" => ("Красноярск"),
    "city_2" => ("Красноярске"),
    "city_3" => ("Красноярска"),
    "address" => ("Красноярский край, г. Красноярск, ул. Копылова дом 48"),
    "important" => (false),
    "coordinates" => [56.012954, 92.819370]
  ),

  array(
    "domain" => ("kursk"),
    "city_1" => ("Курск"),
    "city_2" => ("Курске"),
    "city_3" => ("Курска"),
    "address" => ("Курская обл., г. Курск, ул. Бойцов 9 Дивизии дом 133/1"),
    "important" => (false),
    "coordinates" => [51.733831, 36.162589]
  ),

  array(
    "domain" => ("tver"),
    "city_1" => ("Тверь"),
    "city_2" => ("Твери"),
    "city_3" => ("Твери"),
    "address" => ("Тверская обл., г. Тверь, пр. Калинина дом 18"),
    "important" => (false),
    "coordinates" => [56.855580, 35.868229]
  ),

  array(
    "domain" => ("tolyatti"),
    "city_1" => ("Тольятти"),
    "city_2" => ("Тольятти"),
    "city_3" => ("Тольятти"),
    "address" => ("Тверская обл., г. Тверь, пр. Калинина дом 18"),
    "important" => (false),
    "coordinates" => [56.855580, 35.868229]
  ),

  array(
    "domain" => ("tomsk"),
    "city_1" => ("Томск"),
    "city_2" => ("Томске"),
    "city_3" => ("Томска"),
    "address" => ("Томская обл., г. Томск, ул. Короленко дом 6А"),
    "important" => (false),
    "coordinates" => [56.457229, 85.010836]
  ),

  array(
    "domain" => ("tula"),
    "city_1" => ("Тула"),
    "city_2" => ("Туле"),
    "city_3" => ("Тулы"),
    "address" => ("Тульская обл., г. Тула, ул. Октябрьская дом 9"),
    "important" => (false),
    "coordinates" => [54.206079, 37.619531]
  ),

  array(
    "domain" => ("kemerovo"),
    "city_1" => ("Кемерово"),
    "city_2" => ("Кемерово"),
    "city_3" => ("Кемерова"),
    "address" => ("Кемеровская обл., г. Кемерово, ул. Севастопольская дом 5"),
    "important" => (false),
    "coordinates" => [55.389857, 86.003412]
  ),

  array(
    "domain" => ("kirov"),
    "city_1" => ("Киров"),
    "city_2" => ("Кирове"),
    "city_3" => ("Кирова"),
    "address" => ("Кировская обл., г. Киров, ул. Комсомольская дом 25"),
    "important" => (false),
    "coordinates" => [58.580455, 49.654243]
  ),

  array(
    "domain" => ("novosibirsk"),
    "city_1" => ("Новосибирск"),
    "city_2" => ("Новосибирске"),
    "city_3" => ("Новосибирска"),
    "address" => ("Новосибирская обл., г. Новосибирск, ул. Холодильная дом 16"),
    "important" => (false),
    "coordinates" => [55.050060, 82.885728]
  ),

  array(
    "domain" => ("naberezhnyiechelnyi"),
    "city_1" => ("Набережные Челны"),
    "city_2" => ("Набережных Челнах"),
    "city_3" => ("Набережных Челнов"),
    "address" => ("Татарстан респ., г. Набережные Челны, ул. Спартаковская дом 8"),
    "important" => (false),
    "coordinates" => [55.707816, 52.324664]
  ),

  array(
    "domain" => ("omsk"),
    "city_1" => ("Омск"),
    "city_2" => ("Омске"),
    "city_3" => ("Омска"),
    "address" => ("Омская обл., г. Омск, ул. Богдана Хмельницкого дом 126"),
    "important" => (false),
    "coordinates" => [54.982414, 73.409804]
  ),

  array(
    "domain" => ("perm"),
    "city_1" => ("Пермь"),
    "city_2" => ("Перми"),
    "city_3" => ("Перми"),
    "address" => ("Пермский край, г. Пермь, пер. Максима Горького дом 74"),
    "important" => (false),
    "coordinates" => [58.004285, 56.263400]
  ),

  array(
    "domain" => ("sochi"),
    "city_1" => ("Сочи"),
    "city_2" => ("Сочи"),
    "city_3" => ("Сочи"),
    "address" => ("Краснодарский Край г. Сочи Курортный проспект д.99"),
    "important" => (false),
    "coordinates" => [43.553787, 39.772496]
  ),

  array(
    "domain" => ("stavropol"),
    "city_1" => ("Ставрополь"),
    "city_2" => ("Ставрополе"),
    "city_3" => ("Ставрополя"),
    "address" => ("Ставропольский край, г. Ставрополь, ул. Октябрьская дом 152"),
    "important" => (false),
    "coordinates" => [45.065304, 41.947443]
  ),

  array(
    "domain" => ("kaliningrad"),
    "city_1" => ("Калининград"),
    "city_2" => ("Калининграде"),
    "city_3" => ("Калининграда"),
    "address" => ("Калининградская обл., г. Калининград, ул. Портовая дом 24"),
    "important" => (false),
    "coordinates" => [54.703806, 20.474519]
  ),

  array(
    "domain" => ("kaluga"),
    "city_1" => ("Калуга"),
    "city_2" => ("Калуге"),
    "city_3" => ("Калуги"),
    "address" => ("Калужская обл., г. Калуга, ул. Суворова дом 116"),
    "important" => (false),
    "coordinates" => [54.516020, 36.257927]
  ),


  array(
    "domain" => ("tyumen"),
    "city_1" => ("Тюмень"),
    "city_2" => ("Тюмени"),
    "city_3" => ("Тюмени"),
    "address" => (" Тюменская обл., г. Тюмень, ул. Ямская дом 52"),
    "important" => (false),
    "coordinates" => [57.164158, 65.502420]
  ),

  array(
    "domain" => ("surgut"),
    "city_1" => ("Сургут"),
    "city_2" => ("Сургуте"),
    "city_3" => ("Сургута"),
    "address" => ("Тюменская обл., Ханты-Мансийский-Югра АО, г. Сургут, ул. Энтузиастов дом 63"),
    "important" => (false),
    "coordinates" => [61.263622, 73.370889]
  ),

  array(
    "domain" => ("syiktyivkar"),
    "city_1" => ("Сыктывкар"),
    "city_2" => ("Сыктывкаре"),
    "city_3" => ("Сыктывкара"),
    "address" => ("Коми респ., г. Сыктывкар, ул. Малышева дом 19"),
    "important" => (false),
    "coordinates" => [61.689835, 50.815082]
  ),

  array(
    "domain" => ("murmansk"),
    "city_1" => ("Мурманск"),
    "city_2" => ("Мурманске"),
    "city_3" => ("Мурманска"),
    "address" => ("Мурманская обл., г. Мурманск, ул. Подгорная дом 58"),
    "important" => (false),
    "coordinates" => [68.953779, 33.046612]
  ),

  array(
    "domain" => ("arhangelsk"),
    "city_1" => ("Архангельск"),
    "city_2" => ("Архангельске"),
    "city_3" => ("Архангельска"),
    "address" => ("Архангельская обл., г. Архангельск, пр. Ленинградский дом 354 163016"),
    "important" => (false),
    "coordinates" => [64.492970, 40.710355]
  ),

  array(
    "domain" => ("astrahan"),
    "city_1" => ("Астрахань"),
    "city_2" => ("Астрахане"),
    "city_3" => ("Астрахани"),
    "address" => ("Астраханская обл., г. Астрахань, пер. Девятый дом 11                          414019"),
    "important" => (false),
    "coordinates" => [46.268378, 47.967063]
  ),


  array(
    "domain" => ("vologda"),
    "city_1" => ("Вологда"),
    "city_2" => ("Вологде"),
    "city_3" => ("Вологды"),
    "address" => ("Вологодская обл., г. Вологда, ул. Кубинская дом 11                                    160010 "),
    "important" => (false),
    "coordinates" => [59.245364, 39.839429]
  ),

  array(
    "domain" => ("voronezh"),
    "city_1" => ("Воронеж"),
    "city_2" => ("Воронеже"),
    "city_3" => ("Воронежа"),
    "address" => ("Воронежская обл., г. Воронеж, ул. Ленинградская дом 14"),
    "important" => (false),
    "coordinates" => [51.667574, 39.253611]
  ),

  array(
    "domain" => ("pskov"),
    "city_1" => ("Псков"),
    "city_2" => ("Пскове"),
    "city_3" => ("Пскова"),
    "address" => ("Псковская обл., г. Псков, ул. Максима Горького дом 14/6"),
    "important" => (false),
    "coordinates" => [57.818095, 28.321689]
  ),

  array(
    "domain" => ("velikiynovgorod"),
    "city_1" => ("Великий Новгород"),
    "city_2" => ("Великом Новгороде"),
    "city_3" => ("Великого Новгорода"),
    "address" => ("Новгородская обл., г. Великий Новгород, ул. Большая Московская дом 35 /10"),
    "important" => (false),
    "coordinates" => [58.528289, 31.293334]
  ),

  array(
    "domain" => ("nizhniynovgorod"),
    "city_1" => ("Нижний Новгород"),
    "city_2" => ("Нижнем Новгороде"),
    "city_3" => ("Нижнего Новгорода"),
    "address" => ("Нижегородская обл., г. Нижний Новгород, ул. Рождественская дом 24
    "),
    "important" => (false),
    "coordinates" => [56.328244, 43.988406]
  ),

  array(
    "domain" => ("barnaul"),
    "city_1" => ("Барнаул"),
    "city_2" => ("Барнауле"),
    "city_3" => ("Барнаула"),
    "address" => ("Алтайский край, г. Барнаул, пр. Ленина дом 59                                        656035 "),
    "important" => (false),
    "coordinates" => [53.346435, 83.775904]
  ),

  array(
    "domain" => ("bryansk"),
    "city_1" => ("Брянск"),
    "city_2" => ("Брянске"),
    "city_3" => ("Брянска"),
    "address" => ("Брянская обл., г. Брянск, ул. 3 Интернационала дом 17                                                 241035"),
    "important" => (false),
    "coordinates" => [53.309419, 34.304963]
  ),

  array(
    "domain" => ("novorossiysk"),
    "city_1" => ("Новороссийск"),
    "city_2" => ("Новороссийске"),
    "city_3" => ("Новороссийска"),
    "address" => ("Краснодарский край, г. Новороссийск, шоссе Сухумское дом 60"),
    "important" => (false),
    "coordinates" => [44.736591, 37.802113]
  ),

  array(
    "domain" => ("novokuznetsk"),
    "city_1" => ("Новокузнецк"),
    "city_2" => ("Новокузнецке"),
    "city_3" => ("Новокузнецка"),
    "address" => ("Кемеровская обл., г. Новокузнецк, пр. Строителей дом 72"),
    "important" => (false),
    "coordinates" => [53.773951, 87.126270]
  ),

  array(
    "domain" => ("magadan"),
    "city_1" => ("Магадан"),
    "city_2" => ("Магадане"),
    "city_3" => ("Магадана"),
    "address" => ("Магаданская обл., г. Магадан, ул. Садовая дом 9"),
    "important" => (false),
    "coordinates" => [53.773951, 87.126270]
  ),

  array(
    "domain" => ("ulyanovsk"),
    "city_1" => ("Ульяновск"),
    "city_2" => ("Ульяновске"),
    "city_3" => ("Ульяновска"),
    "address" => ("Ульяновская обл., г. Ульяновск, ул. Гагарина дом 25"),
    "important" => (false),
    "coordinates" => [54.329699, 48.387214]
  ),

  array(
    "domain" => ("cheboksaryi"),
    "city_1" => ("Чебоксары"),
    "city_2" => ("Чебоксарах"),
    "city_3" => ("Чебоксары"),
    "address" => ("Чувашия респ., г. Чебоксары, ул. Ивана Франко дом 14"),
    "important" => (false),
    "coordinates" => [56.143047, 47.269934]
  ),

  array(
    "domain" => ("chelyabinsk"),
    "city_1" => ("Челябинск"),
    "city_2" => ("Челябинск"),
    "city_3" => ("Челябинск"),
    "address" => ("Челябинская обл., г. Челябинск, ул. Российская дом 63 А"),
    "important" => (false),
    "coordinates" => [55.171838, 61.418975]
  ),

  array(
    "domain" => ("cherepovets"),
    "city_1" => ("Череповец"),
    "city_2" => ("Череповеце"),
    "city_3" => ("Череповеца"),
    "address" => ("Вологодская обл., г. Череповец, ул. Архангельская дом 46А"),
    "important" => (false),
    "coordinates" => [59.118645, 37.980087]
  ),

);
